RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_qspi.h
/***************************************************************************//**
 * @file
 * @brief EFM32GG11B_QSPI register and bit field definitions
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#ifdef __cplusplus
extern "C" {
#endif


#if defined(__ICCARM__)
#pragma system_include       /* Treat file as system include file. */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang system_header  /* Treat file as system include file. */
#endif

/***************************************************************************//**
 * @addtogroup Parts
 * @{
 ******************************************************************************/
/***************************************************************************//**
 * @defgroup EFM32GG11B_QSPI QSPI
 * @{
 * @brief EFM32GG11B_QSPI Register Declaration
 ******************************************************************************/
/** QSPI Register Declaration */
typedef struct {
  __IOM uint32_t CONFIG;                     /**< Octal-SPI Configuration Register  */
  __IOM uint32_t DEVINSTRRDCONFIG;           /**< Device Read Instruction Configuration Register  */
  __IOM uint32_t DEVINSTRWRCONFIG;           /**< Device Write Instruction Configuration Register  */
  __IOM uint32_t DEVDELAY;                   /**< Device Delay Register  */
  __IOM uint32_t RDDATACAPTURE;              /**< Read Data Capture Register  */
  __IOM uint32_t DEVSIZECONFIG;              /**< Device Size Configuration Register  */
  __IOM uint32_t SRAMPARTITIONCFG;           /**< SRAM Partition Configuration Register  */
  __IOM uint32_t INDAHBADDRTRIGGER;          /**< Indirect Address Trigger Register  */
  uint32_t       RESERVED0[1U];              /**< Reserved for future use **/
  __IOM uint32_t REMAPADDR;                  /**< Remap Address Register  */
  __IOM uint32_t MODEBITCONFIG;              /**< Mode Bit Configuration Register  */
  __IM uint32_t  SRAMFILL;                   /**< SRAM Fill Register  */
  __IOM uint32_t TXTHRESH;                   /**< TX Threshold Register  */
  __IOM uint32_t RXTHRESH;                   /**< RX Threshold Register  */
  __IOM uint32_t WRITECOMPLETIONCTRL;        /**< Write Completion Control Register  */
  __IOM uint32_t NOOFPOLLSBEFEXP;            /**< Polling Expiration Register  */
  __IOM uint32_t IRQSTATUS;                  /**< Interrupt Status Register  */
  __IOM uint32_t IRQMASK;                    /**< Interrupt Mask  */
  uint32_t       RESERVED1[2U];              /**< Reserved for future use **/
  __IOM uint32_t LOWERWRPROT;                /**< Lower Write Protection Register  */
  __IOM uint32_t UPPERWRPROT;                /**< Upper Write Protection Register  */
  __IOM uint32_t WRPROTCTRL;                 /**< Write Protection Control Register  */
  uint32_t       RESERVED2[1U];              /**< Reserved for future use **/
  __IOM uint32_t INDIRECTREADXFERCTRL;       /**< Indirect Read Transfer Control Register  */
  __IOM uint32_t INDIRECTREADXFERWATERMARK;  /**< Indirect Read Transfer Watermark Register  */
  __IOM uint32_t INDIRECTREADXFERSTART;      /**< Indirect Read Transfer Start Address Register  */
  __IOM uint32_t INDIRECTREADXFERNUMBYTES;   /**< Indirect Read Transfer Number Bytes Register  */
  __IOM uint32_t INDIRECTWRITEXFERCTRL;      /**< Indirect Write Transfer Control Register  */
  __IOM uint32_t INDIRECTWRITEXFERWATERMARK; /**< Indirect Write Transfer Watermark Register  */
  __IOM uint32_t INDIRECTWRITEXFERSTART;     /**< Indirect Write Transfer Start Address Register  */
  __IOM uint32_t INDIRECTWRITEXFERNUMBYTES;  /**< Indirect Write Transfer Number Bytes Register  */
  __IOM uint32_t INDIRECTTRIGGERADDRRANGE;   /**< Indirect Trigger Address Range Register  */
  uint32_t       RESERVED3[2U];              /**< Reserved for future use **/
  __IOM uint32_t FLASHCOMMANDCTRLMEM;        /**< Flash Command Control Memory Register (STIG)  */
  __IOM uint32_t FLASHCMDCTRL;               /**< Flash Command Control Register (STIG)  */
  __IOM uint32_t FLASHCMDADDR;               /**< Flash Command Address Register (STIG)  */
  uint32_t       RESERVED4[2U];              /**< Reserved for future use **/
  __IM uint32_t  FLASHRDDATALOWER;           /**< Flash Command Read Data Register (Lower) (STIG)  */
  __IM uint32_t  FLASHRDDATAUPPER;           /**< Flash Command Read Data Register (Upper) (STIG)  */
  __IOM uint32_t FLASHWRDATALOWER;           /**< Flash Command Write Data Register (Lower) (STIG)  */
  __IOM uint32_t FLASHWRDATAUPPER;           /**< Flash Command Write Data Register (Upper) (STIG)  */
  __IOM uint32_t POLLINGFLASHSTATUS;         /**< Polling Flash Status Register  */
  __IOM uint32_t PHYCONFIGURATION;           /**< PHY Configuration Register  */

  uint32_t       RESERVED5[10U];             /**< Reserved for future use **/
  __IOM uint32_t OPCODEEXTLOWER;             /**< Opcode Extension Register (Lower)  */
  __IOM uint32_t OPCODEEXTUPPER;             /**< Opcode Extension Register (Upper)  */
  uint32_t       RESERVED6[5U];              /**< Reserved for future use **/
  __IM uint32_t  MODULEID;                   /**< Module ID Register  */

