RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_qspi.h
/* Bit fields for QSPI MODULEID */
#define _QSPI_MODULEID_RESETVALUE                                 0x00000200UL                            /**< Default value for QSPI_MODULEID */
#define _QSPI_MODULEID_MASK                                       0xFFFFFF03UL                            /**< Mask for QSPI_MODULEID */
#define _QSPI_MODULEID_CONF_SHIFT                                 0                                       /**< Shift value for QSPI_CONF */
#define _QSPI_MODULEID_CONF_MASK                                  0x3UL                                   /**< Bit mask for QSPI_CONF */
#define _QSPI_MODULEID_CONF_DEFAULT                               0x00000000UL                            /**< Mode DEFAULT for QSPI_MODULEID */
#define QSPI_MODULEID_CONF_DEFAULT                                (_QSPI_MODULEID_CONF_DEFAULT << 0)      /**< Shifted mode DEFAULT for QSPI_MODULEID */
#define _QSPI_MODULEID_MODULEID_SHIFT                             8                                       /**< Shift value for QSPI_MODULEID */
#define _QSPI_MODULEID_MODULEID_MASK                              0xFFFF00UL                              /**< Bit mask for QSPI_MODULEID */
#define _QSPI_MODULEID_MODULEID_DEFAULT                           0x00000002UL                            /**< Mode DEFAULT for QSPI_MODULEID */
#define QSPI_MODULEID_MODULEID_DEFAULT                            (_QSPI_MODULEID_MODULEID_DEFAULT << 8)  /**< Shifted mode DEFAULT for QSPI_MODULEID */
#define _QSPI_MODULEID_FIXPATCH_SHIFT                             24                                      /**< Shift value for QSPI_FIXPATCH */
#define _QSPI_MODULEID_FIXPATCH_MASK                              0xFF000000UL                            /**< Bit mask for QSPI_FIXPATCH */
#define _QSPI_MODULEID_FIXPATCH_DEFAULT                           0x00000000UL                            /**< Mode DEFAULT for QSPI_MODULEID */
#define QSPI_MODULEID_FIXPATCH_DEFAULT                            (_QSPI_MODULEID_FIXPATCH_DEFAULT << 24) /**< Shifted mode DEFAULT for QSPI_MODULEID */

/* Bit fields for QSPI ROUTEPEN */
#define _QSPI_ROUTEPEN_RESETVALUE                                 0x00000000UL                             /**< Default value for QSPI_ROUTEPEN */
#define _QSPI_ROUTEPEN_MASK                                       0x00007FE7UL                             /**< Mask for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_SCLKPEN                                     (0x1UL << 0)                             /**< SCLK Pin Enable */
#define _QSPI_ROUTEPEN_SCLKPEN_SHIFT                              0                                        /**< Shift value for QSPI_SCLKPEN */
#define _QSPI_ROUTEPEN_SCLKPEN_MASK                               0x1UL                                    /**< Bit mask for QSPI_SCLKPEN */
#define _QSPI_ROUTEPEN_SCLKPEN_DEFAULT                            0x00000000UL                             /**< Mode DEFAULT for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_SCLKPEN_DEFAULT                             (_QSPI_ROUTEPEN_SCLKPEN_DEFAULT << 0)    /**< Shifted mode DEFAULT for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_CS0PEN                                      (0x1UL << 1)                             /**< CS0 Pin Enable */
#define _QSPI_ROUTEPEN_CS0PEN_SHIFT                               1                                        /**< Shift value for QSPI_CS0PEN */
#define _QSPI_ROUTEPEN_CS0PEN_MASK                                0x2UL                                    /**< Bit mask for QSPI_CS0PEN */
#define _QSPI_ROUTEPEN_CS0PEN_DEFAULT                             0x00000000UL                             /**< Mode DEFAULT for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_CS0PEN_DEFAULT                              (_QSPI_ROUTEPEN_CS0PEN_DEFAULT << 1)     /**< Shifted mode DEFAULT for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_CS1PEN                                      (0x1UL << 2)                             /**< CS1 Pin Enable */
#define _QSPI_ROUTEPEN_CS1PEN_SHIFT                               2                                        /**< Shift value for QSPI_CS1PEN */
#define _QSPI_ROUTEPEN_CS1PEN_MASK                                0x4UL                                    /**< Bit mask for QSPI_CS1PEN */
#define _QSPI_ROUTEPEN_CS1PEN_DEFAULT                             0x00000000UL                             /**< Mode DEFAULT for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_CS1PEN_DEFAULT                              (_QSPI_ROUTEPEN_CS1PEN_DEFAULT << 2)     /**< Shifted mode DEFAULT for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_DQ0PEN                                      (0x1UL << 5)                             /**< DQ0 Pin Enable */
#define _QSPI_ROUTEPEN_DQ0PEN_SHIFT                               5                                        /**< Shift value for QSPI_DQ0PEN */
#define _QSPI_ROUTEPEN_DQ0PEN_MASK                                0x20UL                                   /**< Bit mask for QSPI_DQ0PEN */
#define _QSPI_ROUTEPEN_DQ0PEN_DEFAULT                             0x00000000UL                             /**< Mode DEFAULT for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_DQ0PEN_DEFAULT                              (_QSPI_ROUTEPEN_DQ0PEN_DEFAULT << 5)     /**< Shifted mode DEFAULT for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_DQ1PEN                                      (0x1UL << 6)                             /**< DQ1 Pin Enable */
#define _QSPI_ROUTEPEN_DQ1PEN_SHIFT                               6                                        /**< Shift value for QSPI_DQ1PEN */
#define _QSPI_ROUTEPEN_DQ1PEN_MASK                                0x40UL                                   /**< Bit mask for QSPI_DQ1PEN */
#define _QSPI_ROUTEPEN_DQ1PEN_DEFAULT                             0x00000000UL                             /**< Mode DEFAULT for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_DQ1PEN_DEFAULT                              (_QSPI_ROUTEPEN_DQ1PEN_DEFAULT << 6)     /**< Shifted mode DEFAULT for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_DQ2PEN                                      (0x1UL << 7)                             /**< DQ2 Pin Enable */
#define _QSPI_ROUTEPEN_DQ2PEN_SHIFT                               7                                        /**< Shift value for QSPI_DQ2PEN */
#define _QSPI_ROUTEPEN_DQ2PEN_MASK                                0x80UL                                   /**< Bit mask for QSPI_DQ2PEN */
#define _QSPI_ROUTEPEN_DQ2PEN_DEFAULT                             0x00000000UL                             /**< Mode DEFAULT for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_DQ2PEN_DEFAULT                              (_QSPI_ROUTEPEN_DQ2PEN_DEFAULT << 7)     /**< Shifted mode DEFAULT for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_DQ3PEN                                      (0x1UL << 8)                             /**< DQ3 Pin Enable */
#define _QSPI_ROUTEPEN_DQ3PEN_SHIFT                               8                                        /**< Shift value for QSPI_DQ3PEN */
#define _QSPI_ROUTEPEN_DQ3PEN_MASK                                0x100UL                                  /**< Bit mask for QSPI_DQ3PEN */
#define _QSPI_ROUTEPEN_DQ3PEN_DEFAULT                             0x00000000UL                             /**< Mode DEFAULT for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_DQ3PEN_DEFAULT                              (_QSPI_ROUTEPEN_DQ3PEN_DEFAULT << 8)     /**< Shifted mode DEFAULT for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_DQ4PEN                                      (0x1UL << 9)                             /**< DQ4 Pin Enable */
#define _QSPI_ROUTEPEN_DQ4PEN_SHIFT                               9                                        /**< Shift value for QSPI_DQ4PEN */
#define _QSPI_ROUTEPEN_DQ4PEN_MASK                                0x200UL                                  /**< Bit mask for QSPI_DQ4PEN */
#define _QSPI_ROUTEPEN_DQ4PEN_DEFAULT                             0x00000000UL                             /**< Mode DEFAULT for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_DQ4PEN_DEFAULT                              (_QSPI_ROUTEPEN_DQ4PEN_DEFAULT << 9)     /**< Shifted mode DEFAULT for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_DQ5PEN                                      (0x1UL << 10)                            /**< DQ5 Pin Enable */
#define _QSPI_ROUTEPEN_DQ5PEN_SHIFT                               10                                       /**< Shift value for QSPI_DQ5PEN */
#define _QSPI_ROUTEPEN_DQ5PEN_MASK                                0x400UL                                  /**< Bit mask for QSPI_DQ5PEN */
#define _QSPI_ROUTEPEN_DQ5PEN_DEFAULT                             0x00000000UL                             /**< Mode DEFAULT for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_DQ5PEN_DEFAULT                              (_QSPI_ROUTEPEN_DQ5PEN_DEFAULT << 10)    /**< Shifted mode DEFAULT for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_DQ6PEN                                      (0x1UL << 11)                            /**< DQ6 Pin Enable */
#define _QSPI_ROUTEPEN_DQ6PEN_SHIFT                               11                                       /**< Shift value for QSPI_DQ6PEN */
#define _QSPI_ROUTEPEN_DQ6PEN_MASK                                0x800UL                                  /**< Bit mask for QSPI_DQ6PEN */
#define _QSPI_ROUTEPEN_DQ6PEN_DEFAULT                             0x00000000UL                             /**< Mode DEFAULT for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_DQ6PEN_DEFAULT                              (_QSPI_ROUTEPEN_DQ6PEN_DEFAULT << 11)    /**< Shifted mode DEFAULT for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_DQ7PEN                                      (0x1UL << 12)                            /**< DQ7 Pin Enable */
#define _QSPI_ROUTEPEN_DQ7PEN_SHIFT                               12                                       /**< Shift value for QSPI_DQ7PEN */
#define _QSPI_ROUTEPEN_DQ7PEN_MASK                                0x1000UL                                 /**< Bit mask for QSPI_DQ7PEN */
#define _QSPI_ROUTEPEN_DQ7PEN_DEFAULT                             0x00000000UL                             /**< Mode DEFAULT for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_DQ7PEN_DEFAULT                              (_QSPI_ROUTEPEN_DQ7PEN_DEFAULT << 12)    /**< Shifted mode DEFAULT for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_DQSPEN                                      (0x1UL << 13)                            /**< DQS Pin Enable */
#define _QSPI_ROUTEPEN_DQSPEN_SHIFT                               13                                       /**< Shift value for QSPI_DQSPEN */
#define _QSPI_ROUTEPEN_DQSPEN_MASK                                0x2000UL                                 /**< Bit mask for QSPI_DQSPEN */
#define _QSPI_ROUTEPEN_DQSPEN_DEFAULT                             0x00000000UL                             /**< Mode DEFAULT for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_DQSPEN_DEFAULT                              (_QSPI_ROUTEPEN_DQSPEN_DEFAULT << 13)    /**< Shifted mode DEFAULT for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_SCLKINPEN                                   (0x1UL << 14)                            /**< SCLKIN Pin Enable */
#define _QSPI_ROUTEPEN_SCLKINPEN_SHIFT                            14                                       /**< Shift value for QSPI_SCLKINPEN */
#define _QSPI_ROUTEPEN_SCLKINPEN_MASK                             0x4000UL                                 /**< Bit mask for QSPI_SCLKINPEN */
#define _QSPI_ROUTEPEN_SCLKINPEN_DEFAULT                          0x00000000UL                             /**< Mode DEFAULT for QSPI_ROUTEPEN */
#define QSPI_ROUTEPEN_SCLKINPEN_DEFAULT                           (_QSPI_ROUTEPEN_SCLKINPEN_DEFAULT << 14) /**< Shifted mode DEFAULT for QSPI_ROUTEPEN */

/* Bit fields for QSPI ROUTELOC0 */
#define _QSPI_ROUTELOC0_RESETVALUE                                0x00000000UL                           /**< Default value for QSPI_ROUTELOC0 */
#define _QSPI_ROUTELOC0_MASK                                      0x00000003UL                           /**< Mask for QSPI_ROUTELOC0 */
#define _QSPI_ROUTELOC0_QSPILOC_SHIFT                             0                                      /**< Shift value for QSPI_QSPILOC */
#define _QSPI_ROUTELOC0_QSPILOC_MASK                              0x3UL                                  /**< Bit mask for QSPI_QSPILOC */
#define _QSPI_ROUTELOC0_QSPILOC_LOC0                              0x00000000UL                           /**< Mode LOC0 for QSPI_ROUTELOC0 */
#define _QSPI_ROUTELOC0_QSPILOC_DEFAULT                           0x00000000UL                           /**< Mode DEFAULT for QSPI_ROUTELOC0 */
#define _QSPI_ROUTELOC0_QSPILOC_LOC1                              0x00000001UL                           /**< Mode LOC1 for QSPI_ROUTELOC0 */
#define _QSPI_ROUTELOC0_QSPILOC_LOC2                              0x00000002UL                           /**< Mode LOC2 for QSPI_ROUTELOC0 */
#define QSPI_ROUTELOC0_QSPILOC_LOC0                               (_QSPI_ROUTELOC0_QSPILOC_LOC0 << 0)    /**< Shifted mode LOC0 for QSPI_ROUTELOC0 */
#define QSPI_ROUTELOC0_QSPILOC_DEFAULT                            (_QSPI_ROUTELOC0_QSPILOC_DEFAULT << 0) /**< Shifted mode DEFAULT for QSPI_ROUTELOC0 */
#define QSPI_ROUTELOC0_QSPILOC_LOC1                               (_QSPI_ROUTELOC0_QSPILOC_LOC1 << 0)    /**< Shifted mode LOC1 for QSPI_ROUTELOC0 */
#define QSPI_ROUTELOC0_QSPILOC_LOC2                               (_QSPI_ROUTELOC0_QSPILOC_LOC2 << 0)    /**< Shifted mode LOC2 for QSPI_ROUTELOC0 */

/** @} */
/** @} End of group EFM32GG11B_QSPI */
/** @} End of group Parts */
#ifdef __cplusplus
}
#endif

